InformationRegisters/ВыпускиПроизводственныхКомплектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВыпускиПроизводственныхКомплектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВсеИзготовленно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПотребностьВМатериалах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПотребностьВМатериалах</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Потребность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ВыданноСоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВыданноСоСклада</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСписанияМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыСписанияМатериалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омРассчетИзделияКомплект/Ext/Module.bsl
&НаСервере
Функция ОпределениеОстаткаПотребности(Дата, мНоменклатура = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделияКомплект
		|ПОМЕСТИТЬ втИзделияКомплект
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыпускиПроизводственныхКомплектов КАК ВыпускиПроизводственныхКомплектов
		|		ПО (ВыпускиПроизводственныхКомплектов.ИзделиеКомплект = ИзделияКомплект.Ссылка)
		|ГДЕ
		|	НЕ ЕСТЬNULL(ВыпускиПроизводственныхКомплектов.ВсеИзготовленно, ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПоставщикуОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуОстатки.КоличествоОстаток КАК Остаток
		|ПОМЕСТИТЬ втЗаказ
		|ИЗ
		|	РегистрНакопления.ЗаказПоставщику.Остатки(
		|			&Дата,
		|			ВЫБОР
		|				КОГДА &ВсяНоменклатура
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Номенклатура В (&Номенклатура)
		|			КОНЕЦ) КАК ЗаказПоставщикуОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотребностьВМатериалахОбороты.Номенклатура КАК Номенклатура,
		|	ПотребностьВМатериалахОбороты.ПотребностьОборот КАК ПотребностьОборот
		|ПОМЕСТИТЬ втПотребность
		|ИЗ
		|	РегистрНакопления.ПотребностьВМатериалах.Обороты(
		|			,
		|			&Дата,
		|			Период,
		|			ВЫБОР
		|					КОГДА &ВсяНоменклатура
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Номенклатура В (&Номенклатура)
		|				КОНЕЦ
		|				И ИзделиеКомплект В
		|					(ВЫБРАТЬ
		|						втИзделияКомплект.ИзделияКомплект
		|					ИЗ
		|						втИзделияКомплект)) КАК ПотребностьВМатериалахОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ втОстатки
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровНаСкладах.Остатки(
		|			&Дата,
		|			ВЫБОР
		|				КОГДА &ВсяНоменклатура
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Номенклатура В (&Номенклатура)
		|			КОНЕЦ) КАК ОстаткиТоваровНаСкладахОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданноСоСклада.Номенклатура КАК Номенклатура,
		|	СУММА(ВыданноСоСклада.Количество) КАК Количество
		|ПОМЕСТИТЬ втВыданно
		|ИЗ
		|	РегистрСведений.ВыданноСоСклада КАК ВыданноСоСклада
		|ГДЕ
		|	ВыданноСоСклада.ИзделиеКомплект В
		|			(ВЫБРАТЬ
		|				втИзделияКомплект.ИзделияКомплект
		|			ИЗ
		|				втИзделияКомплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданноСоСклада.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПотребность.Номенклатура КАК Номенклатура,
		|	втПотребность.Номенклатура.Артикул КАК Артикул,
		|	втПотребность.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	втПотребность.ПотребностьОборот КАК Потребность,
		|	ЕСТЬNULL(втЗаказ.Остаток, 0) КАК Заказано,
		|	ЕСТЬNULL(втОстатки.КоличествоОстаток, 0) КАК Остаток,
		|	ЕСТЬNULL(втВыданно.Количество, 0) КАК Выдано
		|ИЗ
		|	втПотребность КАК втПотребность
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЗаказ КАК втЗаказ
		|		ПО втПотребность.Номенклатура = втЗаказ.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
		|		ПО втПотребность.Номенклатура = втОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ втВыданно КАК втВыданно
		|		ПО втПотребность.Номенклатура = втВыданно.Номенклатура";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", мНоменклатура);
	Запрос.УстановитьПараметр("ВсяНоменклатура", мНоменклатура = Неопределено);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьОстатокПотребности()

&НаСервере
Функция ИзделияКомплектБезВыпуска() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделияКомплект
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыпускиПроизводственныхКомплектов КАК ВыпускиПроизводственныхКомплектов
		|		ПО (ВыпускиПроизводственныхКомплектов.ИзделиеКомплект = ИзделияКомплект.Ссылка)
		|ГДЕ
		|	НЕ ЕСТЬNULL(ВыпускиПроизводственныхКомплектов.ВсеИзготовленно, ЛОЖЬ)"; 
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИзделияКомплект");
		
КонецФункции // ИзделияКомплектБезВыпуска()
 
&НаСервере
Функция ОпределениеОстаткаПоступления(Дата, мНоменклатура = Неопределено, Поставщик = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ЗаказПоставщику.Остатки(
		|			&Дата,
		|			ВЫБОР
		|					КОГДА &ВсяНоменклатура
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Номенклатура В (&Номенклатура)
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ВсеПоставщики
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Поставщик В (&Поставщик)
		|				КОНЕЦ) КАК ЗаказПоставщикуОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", мНоменклатура);
	Запрос.УстановитьПараметр("ВсяНоменклатура", мНоменклатура = Неопределено);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("ВсеПоставщики", Поставщик = Неопределено);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ОпределениеОстаткаПоступления()
